---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBackDirn1
source: html/3f54c34f-76bb-be21-1ef6-bb83aebbbed9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBackDirn1 Property

"Interior Major Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookOrientBackDirn1 { get; }
```